vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC5512_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter" Cversion="1.0.0" condition="component.usart_adapter.condition_id">
      <description>Component usart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_usart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8524_adapter" Cversion="2.2.0" condition="component.wm8524_adapter.condition_id">
      <description>Component wm8524 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.h" projectpath="codec/port/wm8524"/>
        <file category="sourceC" name="components/codec/port/wm8524/fsl_codec_wm8524_adapter.c" projectpath="codec/port/wm8524"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8524/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="component.wm8904_adapter.condition_id">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h" projectpath="codec/port/wm8904"/>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c" projectpath="codec/port/wm8904"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8904/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8960_adapter" Cversion="2.2.0" condition="component.wm8960_adapter.condition_id">
      <description>Component wm8960 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.h" projectpath="codec/port/wm8960"/>
        <file category="sourceC" name="components/codec/port/wm8960/fsl_codec_wm8960_adapter.c" projectpath="codec/port/wm8960"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8960/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8962_adapter" Cversion="2.2.0" condition="component.wm8962_adapter.condition_id">
      <description>Component wm8962 adapter for single codecs</description>
      <files>
        <file category="header" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.h" projectpath="codec/port/wm8962"/>
        <file category="sourceC" name="components/codec/port/wm8962/fsl_codec_wm8962_adapter.c" projectpath="codec/port/wm8962"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/wm8962/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC5512_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device LPC5512_cmsis</description>
      <files>
        <file category="header" name="devices/LPC5512/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/LPC5512/LPC5512.h" projectpath="device"/>
        <file category="header" name="devices/LPC5512/LPC5512_features.h" projectpath="device"/>
        <file category="header" name="devices/LPC5512/LPC5512_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_ADC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_AHB_SECURE_CTRL.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_ANACTRL.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_CAN.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_CASPER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_CDOG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_CRC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_CTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_DBGMAILBOX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_DMA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_FLASH.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_FLASH_CFPA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_FLASH_CMPA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_FLASH_KEY_STORE.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_FLASH_NMPA.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_FLASH_ROMPATCH.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_FLEXCOMM.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_GINT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_GPIO.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_HASHCRYPT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_I2C.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_I2S.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_INPUTMUX.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_IOCON.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_MRT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_OSTIMER.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_PINT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_PLU.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_PMC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_PRINCE.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_PUF.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_PUF_SRAM_CTRL.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_RNG.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_RTC.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_SCT.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_SPI.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_SYSCON.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_SYSCTL.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_USART.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_USB.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_USBFSH.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_USBHSD.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_USBHSH.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_USBPHY.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_UTICK.h" projectpath="device/periph2"/>
        <file category="header" name="devices/LPC5512/periph2/PERI_WWDT.h" projectpath="device/periph2"/>
        <file category="include" name="devices/LPC5512/"/>
        <file category="include" name="devices/LPC5512/periph2/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="devices/LPC5512/template/RTE_Device.h" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/LPC5512/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="LPC5512_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device LPC5512_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=LPC5512.condition_id" category="linkerScript" attr="config" name="devices/LPC5512/arm/LPC5512_flash.scf" version="1.0.0" projectpath="LPC5512/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=LPC5512.condition_id" category="linkerScript" attr="config" name="devices/LPC5512/arm/LPC5512_ram.scf" version="1.0.0" projectpath="LPC5512/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=LPC5512.condition_id" category="linkerScript" attr="config" name="devices/LPC5512/gcc/LPC5512_flash.ld" version="1.0.0" projectpath="LPC5512/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=LPC5512.condition_id" category="linkerScript" attr="config" name="devices/LPC5512/gcc/LPC5512_ram.ld" version="1.0.0" projectpath="LPC5512/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=LPC5512.condition_id" category="linkerScript" attr="config" name="devices/LPC5512/iar/LPC5512_flash.icf" version="1.0.0" projectpath="LPC5512/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=LPC5512.condition_id" category="linkerScript" attr="config" name="devices/LPC5512/iar/LPC5512_ram.icf" version="1.0.0" projectpath="LPC5512/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="LPC5512" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template LPC5512</description>
      <files>
        <file category="header" attr="config" name="devices/LPC5512/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5512/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC5512/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5512/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC5512/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5512/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/LPC5512/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/LPC5512/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/LPC5512/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device LPC5512_startup</description>
      <files>
        <file condition="allOf.toolchains=iar.condition_id" category="sourceAsm" attr="config" name="devices/LPC5512/iar/startup_LPC5512.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc.condition_id" category="sourceAsm" attr="config" name="devices/LPC5512/gcc/startup_LPC5512.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk.condition_id" category="sourceAsm" attr="config" name="devices/LPC5512/arm/startup_LPC5512.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC5512_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device LPC5512_system</description>
      <files>
        <file category="sourceC" name="devices/LPC5512/system_LPC5512.c" projectpath="device"/>
        <file category="header" name="devices/LPC5512/system_LPC5512.h" projectpath="device"/>
        <file category="include" name="devices/LPC5512/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
